app/Controllers/Auth.php

    public function attemptLogin(): RedirectResponse
    {
        $rules = [
            'username' => 'required|max_length[80]',
            'password' => 'required|max_length[255]',
        ];

        if (! $this->validateData($this->request->getPost(), $rules)) {
            return redirect()->back()->withInput();
        }

        $values = $this->validator->getValidated();
        $user = (new UserModel())
            ->where('username', trim($values['username']))
            ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'cashier01'
 LIMIT 1