app/Controllers/Customers.php

SELECT *
FROM `customers`
ORDER BY `id` ASC
---
    public function index(): string
    {
        $customerModel = new CustomerModel();

        return view('customers/index', [
            'title' => 'Customer Accounts',
            'customers' => $customerModel->orderBy('id', 'ASC')->findAll(),
        ]);

SELECT *
FROM `customers`
WHERE `customers`.`id` = 1
---
    public function edit(int $id): string|RedirectResponse
    {
        $customer = (new CustomerModel())->find($id);