app/Controllers/Users.php

    public function index(): string
    {
        $users = (new UserModel())->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` ASC

    public function edit(int $id): string|RedirectResponse
    {
        $user = (new UserModel())->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1

    public function update(int $id): RedirectResponse
    {
        $userModel = new UserModel();
        $existingUser = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1