app/Models/TaskModel.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-05'
ORDER BY `task_date` ASC
---
    public function forToday(): array
    {
        return $this->where('task_date', date('Y-m-d'))
            ->orderBy('task_date', 'ASC')
            ->findAll();